ProyectilMx/proyectilmx.github.io/avr/boards.txt
13.menu.clock.1M=1 MHz external clock
13.menu.clock.1M.bootloader.clock=external_oscillator
13.menu.clock.1M.bootloader.low_fuses=0b0{bootloader.eesave_bit}111000
13.menu.clock.1M.bootloader.baudrate=19200
13.menu.clock.1M.bootloader.speed=1000000_hz
13.menu.clock.1M.bootloader.speed-125=1000000_hz
13.menu.clock.1M.bootloader.speed-250=1000000_hz
13.menu.clock.1M.bootloader.speed-375=1000000_hz
13.menu.clock.1M.bootloader.speed-500=1000000_hz
13.menu.clock.1M.bootloader.speed-625=1000000_hz
13.menu.clock.1M.bootloader.speed-750=1000000_hz
13.menu.clock.1M.bootloader.speed-875=1000000_hz
13.menu.clock.1M.bootloader.speed-1000=1000000_hz
13.menu.clock.1M.bootloader.speed+125=1000000_hz
13.menu.clock.1M.bootloader.speed+250=1000000_hz
13.menu.clock.1M.bootloader.speed+375=1000000_hz
13.menu.clock.1M.bootloader.speed+500=1000000_hz
13.menu.clock.1M.build.f_cpu=1000000L

# EEPROM
13.menu.eeprom.keep=EEPROM retained
13.menu.eeprom.keep.bootloader.eesave_bit=0
13.menu.eeprom.erase=EEPROM not retained
13.menu.eeprom.erase.bootloader.eesave_bit=1

# Brown out detection
13.menu.BOD.2v7=BOD 2.7V
13.menu.BOD.2v7.fuse.bod=b
13.menu.BOD.4v3=BOD 4.3V
13.menu.BOD.4v3.fuse.bod=9
13.menu.BOD.1v8=BOD 1.8V
13.menu.BOD.1v8.fuse.bod=d
13.menu.BOD.disabled=BOD disabled
13.menu.BOD.disabled.fuse.bod=f


# Bootloader
13.menu.bootloader.no_bootloader=No bootloader
13.menu.bootloader.no_bootloader.upload.maximum_size=1024
13.menu.bootloader.no_bootloader.fuse.selfprogen=f
13.menu.bootloader.no_bootloader.bootloader.flash=

13.menu.bootloader.rx_pb1_tx_pb0_0=Yes
13.menu.bootloader.rx_pb1_tx_pb0_0.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_0.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_0.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_0.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_0.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-125=Yes (F_CPU -1.25%)
13.menu.bootloader.rx_pb1_tx_pb0_-125.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-125.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-125.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-125.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-125}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-125.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-250=Yes (F_CPU -2.50%)
13.menu.bootloader.rx_pb1_tx_pb0_-250.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-250.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-250.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-250.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-250}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-250.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-375=Yes (F_CPU -3.75%)
13.menu.bootloader.rx_pb1_tx_pb0_-375.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-375.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-375.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-375.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-375}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-375.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-500=Yes (F_CPU -5.00%)
13.menu.bootloader.rx_pb1_tx_pb0_-500.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-500.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-500.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-500.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-500}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-500.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-625=Yes (F_CPU -6.25%)
13.menu.bootloader.rx_pb1_tx_pb0_-625.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-625.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-625.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-625.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-625}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-625.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-750=Yes (F_CPU -7.50%)
13.menu.bootloader.rx_pb1_tx_pb0_-750.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-750.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-750.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-750.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-750}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-750.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-875=Yes (F_CPU -8.75%)
13.menu.bootloader.rx_pb1_tx_pb0_-875.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-875.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-875.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-875.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-875}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-875.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_-1000=Yes (F_CPU -10.0%)
13.menu.bootloader.rx_pb1_tx_pb0_-1000.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_-1000.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_-1000.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_-1000.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed-1000}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_-1000.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_+125=Yes (F_CPU +1.25%)
13.menu.bootloader.rx_pb1_tx_pb0_+125.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_+125.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_+125.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_+125.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed+125}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_+125.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_+250=Yes (F_CPU +2.50%)
13.menu.bootloader.rx_pb1_tx_pb0_+250.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_+250.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_+250.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_+250.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed+250}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_+250.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_+375=Yes (F_CPU +3.75%)
13.menu.bootloader.rx_pb1_tx_pb0_+375.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_+375.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_+375.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_+375.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed+375}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_+375.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i

13.menu.bootloader.rx_pb1_tx_pb0_+500=Yes (F_CPU +5.00%)
13.menu.bootloader.rx_pb1_tx_pb0_+500.upload.protocol=urclock
13.menu.bootloader.rx_pb1_tx_pb0_+500.upload.maximum_size=768
13.menu.bootloader.rx_pb1_tx_pb0_+500.fuse.selfprogen=e
13.menu.bootloader.rx_pb1_tx_pb0_+500.bootloader.file=urboot/watchdog_1_s/{bootloader.clock}/{bootloader.speed+500}/{bootloader.baudrate}_baud/swio_rxb1_txb0/no-led/urboot_attiny13a.hex
13.menu.bootloader.rx_pb1_tx_pb0_+500.bootloader.flash=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i


###########################################################
minisphinx.name=miniSphinx

minisphinx.vid.0=0x2341
minisphinx.pid.0=0x0010
minisphinx.vid.1=0x2341
minisphinx.pid.1=0x0042
minisphinx.vid.2=0x2A03
minisphinx.pid.2=0x0010
minisphinx.vid.3=0x2A03
minisphinx.pid.3=0x0042
minisphinx.vid.4=0x2341
minisphinx.pid.4=0x0210
minisphinx.vid.5=0x2341
minisphinx.pid.5=0x0242

minisphinx.upload.tool=avrdude
minisphinx.upload.maximum_data_size=8192

minisphinx.bootloader.tool=avrdude
minisphinx.bootloader.low_fuses=0xFF
minisphinx.bootloader.unlock_bits=0x3F
minisphinx.bootloader.lock_bits=0x0F

minisphinx.build.f_cpu=16000000L
minisphinx.build.core=arduino
minisphinx.build.variant=mega
# default board may be overridden by the cpu menu
minisphinx.build.board=AVR_MEGA2560

minisphinx.upload.protocol=wiring
minisphinx.upload.maximum_size=253952
minisphinx.upload.speed=115200

minisphinx.bootloader.high_fuses=0xD8
minisphinx.bootloader.extended_fuses=0xFD
minisphinx.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex

minisphinx.build.mcu=atmega2560
minisphinx.build.board=AVR_MEGA2560